---
kind: property
id: P:Autodesk.Revit.DB.EdgeArray.IsEmpty
source: html/3f4d00a8-9044-0f08-9cfe-813bfb7226ff.htm
---
# Autodesk.Revit.DB.EdgeArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.